Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГИГ_ОЕМПотребность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГИГ_Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Назначения/Ext/ManagerModule.bsl
&Вместо("ПриЗаписиДокумента")
Процедура Рин1_ПриЗаписиДокумента(Назначение, ШаблонНазначения, ЭтотОбъект, Получатель, ВидДеятельностиНДС)
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, ПометкаУдаления");
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ЭтотОбъект);
	РеквизитыДокумента.Вставить("Получатель",         Получатель);
	РеквизитыДокумента.Вставить("ВидДеятельностиНДС", ВидДеятельностиНДС);
	
	УстановитьПривилегированныйРежим(Истина);
	РеквизитыНазначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Назначение,
	//++Гольм А.А. (Гигабайт): ОЕМПотребность
	//"Наименование, ПометкаУдаления, Заказ, НаправлениеДеятельности, Партнер, Договор, ВидДеятельностиНДС, ТипНазначения");
	"Наименование, ПометкаУдаления, Заказ, НаправлениеДеятельности, Партнер, Договор, ВидДеятельностиНДС, ТипНазначения, ГИГ_ОЕМПотребность, ГИГ_Партнер");
	//--Гольм А.А. (Гигабайт)
	
	
	//++Гольм А.А. (Гигабайт): ОЕМПотребность	
	Если ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда
		РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Ссылка, "ГИГ_ОЕМПотребность, ГИГ_ПредставлениеОЕМПотребности, ГИГ_Партнер");		
		ГИГ_ОЕМПотребность      = РеквизитыЗаказа.ГИГ_ОЕМПотребность;
		ГИГ_Партнер             = РеквизитыЗаказа.ГИГ_Партнер;
		ПредставлениеНазначения = РеквизитыЗаказа.ГИГ_ПредставлениеОЕМПотребности;
	Иначе
		ГИГ_ОЕМПотребность      = Ложь;
		ГИГ_Партнер             = Справочники.Партнеры.ПустаяСсылка();
//20200928 ГлазуновДВ отключили
		//Если РеквизитыНазначения.Наименование <> Неопределено Тогда
		//	ПредставлениеНазначения = ПредставлениеНазначения(РеквизитыНазначения, РеквизитыДокумента);
		//Иначе
		//	ПредставлениеНазначения = ПредставлениеНазначения(ШаблонНазначения, РеквизитыДокумента);
		//КонецЕсли;
	КонецЕсли; 
	//--Гольм А.А. (Гигабайт)
//{{20200928 ГлазуновДВ
	Если Не ГИГ_ОЕМПотребность Тогда
		Если РеквизитыНазначения.Наименование <> Неопределено Тогда
			ПредставлениеНазначения = ПредставлениеНазначения(РеквизитыНазначения, РеквизитыДокумента);
		Иначе
			ПредставлениеНазначения = ПредставлениеНазначения(ШаблонНазначения, РеквизитыДокумента);
		КонецЕсли;
	КонецЕсли;
//}}20200928 ГлазуновДВ
	Если РеквизитыНазначения.Наименование <> Неопределено Тогда
		//++Гольм А.А. (Гигабайт): ОЕМПотребность
		//ПредставлениеНазначения = ПредставлениеНазначения(РеквизитыНазначения, РеквизитыДокумента);
		ОбновитьОЕМПотребность  = РеквизитыНазначения.ГИГ_ОЕМПотребность <> ГИГ_ОЕМПотребность;
		ОбновитьПартнера 	    = РеквизитыНазначения.ГИГ_Партнер <> ГИГ_Партнер;
		//--Гольм А.А. (Гигабайт)
		ОбновитьПометкуУдаления    = ЗначениеЗаполнено(РеквизитыНазначения.Заказ)
		И РеквизитыНазначения.ПометкаУдаления <> РеквизитыДокумента.ПометкаУдаления;
		ОбновитьВидДеятельностиНДС = ЗначениеЗаполнено(РеквизитыНазначения.Заказ)
		И РеквизитыНазначения.ВидДеятельностиНДС <> РеквизитыДокумента.ВидДеятельностиНДС;
		ОбновитьНаименование       = РеквизитыНазначения.Наименование <> ПредставлениеНазначения;
		
		//++Гольм А.А. (Гигабайт): ОЕМПотребность
		//Если ОбновитьПометкуУдаления Или ОбновитьВидДеятельностиНДС Или ОбновитьНаименование Тогда
		Если ОбновитьПометкуУдаления Или ОбновитьВидДеятельностиНДС Или ОбновитьНаименование Или ОбновитьОЕМПотребность Или ОбновитьПартнера Тогда
			//--Гольм А.А. (Гигабайт)
			
			НазначениеОбъект = Назначение.ПолучитьОбъект();
			//++Гольм А.А. (Гигабайт): ОЕМПотребность
			Если ОбновитьОЕМПотребность Тогда
				НазначениеОбъект.ГИГ_ОЕМПотребность = ГИГ_ОЕМПотребность;
			КонецЕсли;
			
			Если ОбновитьПартнера Тогда
				НазначениеОбъект.ГИГ_Партнер = ГИГ_Партнер;
			КонецЕсли;
			//--Гольм А.А. (Гигабайт)
			Если ОбновитьПометкуУдаления Тогда
				НазначениеОбъект.ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
			КонецЕсли;
			
			Если ОбновитьВидДеятельностиНДС Тогда
				НазначениеОбъект.ВидДеятельностиНДС = РеквизитыДокумента.ВидДеятельностиНДС;
			КонецЕсли;
			
			Если ОбновитьНаименование Тогда
				НазначениеОбъект.Наименование = ПредставлениеНазначения;
			КонецЕсли;
			НазначениеОбъект.Записать();
			
		КонецЕсли;
		
	Иначе // Это новое назначение
		//++Гольм А.А. (Гигабайт): ОЕМПотребность
		//ПредставлениеНазначения = ПредставлениеНазначения(ШаблонНазначения, РеквизитыДокумента);
		//--Гольм А.А. (Гигабайт)
		
		НазначениеОбъект = Справочники.Назначения.СоздатьЭлемент();
		НазначениеОбъект.УстановитьСсылкуНового(Назначение);
		
		НазначениеОбъект.НаправлениеДеятельности = ШаблонНазначения.НаправлениеДеятельности;
		НазначениеОбъект.Партнер                 = ШаблонНазначения.Партнер;
		НазначениеОбъект.Договор                 = ШаблонНазначения.Договор;
		НазначениеОбъект.Заказ                   = ШаблонНазначения.Заказ;
		НазначениеОбъект.ТипНазначения           = ШаблонНазначения.ТипНазначения;
		НазначениеОбъект.Наименование            = ПредставлениеНазначения;
		Если ЗначениеЗаполнено(ШаблонНазначения.Заказ) Тогда
			НазначениеОбъект.ПометкаУдаления    = РеквизитыДокумента.ПометкаУдаления;
			НазначениеОбъект.ВидДеятельностиНДС = РеквизитыДокумента.ВидДеятельностиНДС;
		КонецЕсли;
		//++Гольм А.А. (Гигабайт): ОЕМПотребность
		НазначениеОбъект.ГИГ_ОЕМПотребность      = ГИГ_ОЕМПотребность;
		НазначениеОбъект.ГИГ_Партнер             = ГИГ_Партнер;
		//--Гольм А.А. (Гигабайт)
		НазначениеОбъект.Записать();
		
	КонецЕсли;
	
	//ПродолжитьВызов(Назначение, ШаблонНазначения, ЭтотОбъект, Получатель, ВидДеятельностиНДС);
КонецПроцедуры
